Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/atdf/PIC32MK0512GPG064.atdf
            <instance name="CLC4">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01427" name="CMP" version="">
            <instance name="CMP">
               <register-group address-space="periph_pb2_std" name="CMP" name-in-module="CMP" offset="0x1f82c000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00000" name="CORE" version="">
            <instance name="CORE">
               <register-group address-space="" name="CORE" name-in-module="CORE" offset="0x0" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
        <module id="02823" name="CRU" version="">
            <instance name="CRU">
               <register-group address-space="periph_pb1_std" name="CRU" name-in-module="CRU" offset="0x1f801200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02823" name="RCON" version="">
            <instance name="RCON">
               <register-group address-space="periph_pb1_std" name="RCON" name-in-module="RCON" offset="0x1f801200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01461" name="CTMU" version="">
            <instance name="CTMU">
               <register-group address-space="periph_pb2_std" name="CTMU" name-in-module="CTMU" offset="0x1f82d000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01500" name="DMAC" version="">
            <instance name="DMAC">
               <register-group address-space="periph_pb1_fast" name="DMAC" name-in-module="DMAC" offset="0x1f811000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01520" name="DMT" version="">
            <instance name="DMT">
               <register-group address-space="periph_pb1_std" name="DMT" name-in-module="DMT" offset="0x1f800e00" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02467" name="GPIO" version="">
            <instance name="GPIO">
               <register-group address-space="periph_pb4_std" name="GPIO" name-in-module="GPIO" offset="0x1f860000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02511" name="HLVD" version="">
            <instance name="HLVD">
               <register-group address-space="periph_pb1_std" name="HLVD" name-in-module="HLVD" offset="0x1f801800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01441" name="I2C" version="">
            <instance name="I2C1">
               <register-group address-space="periph_pb2_std" name="I2C" name-in-module="I2C" offset="0x1f826000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="I2C2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00740" name="ICAP" version="">
            <instance name="ICAP1">
               <register-group address-space="periph_pb2_std" name="ICAP" name-in-module="ICAP" offset="0x1f822000" />
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 5"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 4"/>
               </parameters>
            </instance>
            <instance name="ICAP2">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 5"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 4"/>
               </parameters>
            </instance>
            <instance name="ICAP3">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 5"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 4"/>
               </parameters>
            </instance>
            <instance name="ICAP4">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP5">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
