Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/atdf/PIC32MK0512GPG064.atdf
         <register caption="ADC1 Configuration Register" name="ADC1CFG" offset="0xd10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC2 Configuration Register" name="ADC2CFG" offset="0xd20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC3 Configuration Register" name="ADC3CFG" offset="0xd30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC4 Configuration Register" name="ADC4CFG" offset="0xd40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC5 Configuration Register" name="ADC5CFG" offset="0xd50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC6 Configuration Register" name="ADC6CFG" offset="0xd60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC7 Configuration Register" name="ADC7CFG" offset="0xd70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="ADC System Configuration Register 0" name="ADCSYSCFG0" offset="0xe00" rw="R" size="4">
            <bitfield mask="0x00000001" name="AN0" />
            <bitfield mask="0x00000002" name="AN1" />
            <bitfield mask="0x00000004" name="AN2" />
            <bitfield mask="0x00000008" name="AN3" />
            <bitfield mask="0x00000010" name="AN4" />
            <bitfield mask="0x00000020" name="AN5" />
            <bitfield mask="0x00000040" name="AN6" />
            <bitfield mask="0x00000080" name="AN7" />
            <bitfield mask="0x00000100" name="AN8" />
            <bitfield mask="0x00000200" name="AN9" />
            <bitfield mask="0x00000400" name="AN10" />
            <bitfield mask="0x00000800" name="AN11" />
            <bitfield mask="0x00001000" name="AN12" />
            <bitfield mask="0x00002000" name="AN13" />
            <bitfield mask="0x00004000" name="AN14" />
            <bitfield mask="0x00008000" name="AN15" />
            <bitfield mask="0x00010000" name="AN16" />
            <bitfield mask="0x00020000" name="AN17" />
            <bitfield mask="0x00040000" name="AN18" />
            <bitfield mask="0x00080000" name="AN19" />
            <bitfield mask="0x00100000" name="AN20" />
            <bitfield mask="0x00200000" name="AN21" />
            <bitfield mask="0x00400000" name="AN22" />
            <bitfield mask="0x00800000" name="AN23" />
            <bitfield mask="0x01000000" name="AN24" />
            <bitfield mask="0x02000000" name="AN25" />
            <bitfield mask="0x04000000" name="AN26" />
            <bitfield mask="0x08000000" name="AN27" />
         </register>
         <register caption="ADC System Configuration Register 1" name="ADCSYSCFG1" offset="0xe10" rw="R" size="4">
            <bitfield mask="0x00000002" name="AN33" />
            <bitfield mask="0x00000004" name="AN34" />
            <bitfield mask="0x00000008" name="AN35" />
            <bitfield mask="0x00000010" name="AN36" />
            <bitfield mask="0x00000020" name="AN37" />
            <bitfield mask="0x00000040" name="AN38" />
            <bitfield mask="0x00000080" name="AN39" />
            <bitfield mask="0x00000100" name="AN40" />
            <bitfield mask="0x00000200" name="AN41" />
            <bitfield mask="0x00002000" name="AN45" />
            <bitfield mask="0x00004000" name="AN46" />
            <bitfield mask="0x00008000" name="AN47" />
            <bitfield mask="0x00010000" name="AN48" />
            <bitfield mask="0x00020000" name="AN49" />
            <bitfield mask="0x00040000" name="AN50" />
            <bitfield mask="0x00200000" name="AN53" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA0" offset="0x600" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA1" offset="0x610" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA2" offset="0x620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA3" offset="0x630" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA4" offset="0x640" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA5" offset="0x650" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA6" offset="0x660" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA7" offset="0x670" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA8" offset="0x680" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA9" offset="0x690" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register 'x' ('x' = 0-27 33-41 and 45-53" name="ADCDATA10" offset="0x6a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
