Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/atdf/PIC32MK0512GPG064.atdf
         <register caption="" name="CFGCON2" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="EEWS" />
         </register>
      </register-group>
      <value-group caption="TDO Enable for 2-Wire JTAG" name="CFGCON__TDOEN">
         <value caption="2-wire JTAG protocol uses TDO" name="" value="0x1" />
         <value caption="2-wire JTAG protocol does not use TDO" name="" value="0x0" />
      </value-group>
      <value-group caption="Trace Output Enable bit" name="CFGCON__TROEN">
         <value caption="Enable trace outputs and start trace clock (trace probe must be present)" name="" value="0x1" />
         <value caption="Disable trace outputs and stop trace clock" name="" value="0x0" />
      </value-group>
      <value-group caption="JTAG Port Enable bit" name="CFGCON__JTAGEN">
         <value caption="Enable the JTAG port" name="" value="0x1" />
         <value caption="Disable the JTAG port" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash ECC Configuration bits" name="CFGCON__ECCCON">
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are writable)" name="" value="0x3" />
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are locked)" name="" value="0x2" />
         <value caption="Dynamic Flash ECC is enabled (ECCCON bits are locked)" name="" value="0x1" />
         <value caption="Flash ECC is enabled (ECCCON bits are locked; disables word Flash writes)" name="" value="0x0" />
      </value-group>
      <value-group caption="I/O Analog Charge Pump Enable bit" name="CFGCON__IOANCPEN">
         <value caption="Charge pump is enabled" name="" value="0x1" />
         <value caption="Charge pump is disabled (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Permission Group Lock bit" name="CFGCON__PGLOCK">
         <value caption="Permission Group registers are locked. Writes to PG registers are not allowed" name="" value="0x1" />
         <value caption="Permission Group registers are not locked. Writes to PG registers are allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Module Disable bit" name="CFGCON__PMDLOCK">
         <value caption="Peripheral module is locked. Writes to PMD registers are not allowed" name="" value="0x1" />
         <value caption="Peripheral module is not locked. Writes to PMD registers are allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Pin Select Lock bit" name="CFGCON__IOLOCK">
         <value caption="Peripheral Pin Select is locked. Writes to PPS registers are not allowed" name="" value="0x1" />
         <value caption="Peripheral Pin Select is not locked. Writes to PPS registers are allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Alternate Clock Selection bit" name="CFGCON__OCACLK">
         <value caption="Output Compare modules use an alternative Timer pair as their timebase clock" name="" value="0x1" />
         <value caption="All Output Compare modules use Timer2/3 as their timebase clock" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Alternate Clock Selection bit" name="CFGCON__ICACLK">
         <value caption="Input Capture modules use an alternative Timer pair as their timebase clock" name="" value="0x1" />
         <value caption="All Input Capture modules use Timer2/3 as their timebase clock" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Arbitration Priority to SRAM bit" name="CFGCON__ADCPRI">
         <value caption="ADC gets High Priority access to SRAM" name="" value="0x1" />
         <value caption="ADC uses Least Recently Serviced Arbitration (same as other initiators)" name="" value="0x0" />
      </value-group>
      <value-group caption="CPU Instruction Space Permission Group bits" name="CFGPG__CPUPG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
      <value-group caption="CPU Instruction Data Space Permission Group bits" name="CFGPG__CPUDSPG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Module Permission Group bits" name="CFGPG__DMAPG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN1 Module Permission Group bits" name="CFGPG__CAN1PG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
