Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/atdf/PIC32MK0512GPG064.atdf
         <register caption="" name="CLC3SEL" offset="0x410" rw="RW" size="4">
            <bitfield caption="Data Selection MUX 1 Signal Selection bits" mask="0x00000007" name="DS1" values="CLC3SEL__DS1" />
            <bitfield caption="Data Selection MUX 2 Signal Selection bits" mask="0x00000070" name="DS2" values="CLC3SEL__DS2" />
            <bitfield caption="Data Selection MUX 3 Signal Selection bits" mask="0x00000700" name="DS3" values="CLC3SEL__DS3" />
            <bitfield caption="Data Selection MUX 4 Signal Selection bits" mask="0x00007000" name="DS4" values="CLC3SEL__DS4" />
         </register>
         <register caption="" name="CLC4SEL" offset="0x610" rw="RW" size="4">
            <bitfield caption="Data Selection MUX 1 Signal Selection bits" mask="0x00000007" name="DS1" values="CLC4SEL__DS1" />
            <bitfield caption="Data Selection MUX 2 Signal Selection bits" mask="0x00000070" name="DS2" values="CLC4SEL__DS2" />
            <bitfield caption="Data Selection MUX 3 Signal Selection bits" mask="0x00000700" name="DS3" values="CLC4SEL__DS3" />
            <bitfield caption="Data Selection MUX 4 Signal Selection bits" mask="0x00007000" name="DS4" values="CLC4SEL__DS4" />
         </register>
         <register caption="" name="CLC1GLS" offset="0x20" rw="RW" size="4">
            <bitfield caption="Gate 1 Data Source 1 Negated Enable bit" mask="0x00000001" name="G1D1N" values="CLC1GLS__G1D1N" />
            <bitfield caption="Gate 1 Data Source 1 True Enable bit" mask="0x00000002" name="G1D1T" values="CLC1GLS__G1D1T" />
            <bitfield caption="Gate 1 Data Source 2 Negated Enable bit" mask="0x00000004" name="G1D2N" values="CLC1GLS__G1D2N" />
            <bitfield caption="Gate 1 Data Source 2 True Enable bit" mask="0x00000008" name="G1D2T" values="CLC1GLS__G1D2T" />
            <bitfield caption="Gate 1 Data Source 3 Negated Enable bit" mask="0x00000010" name="G1D3N" values="CLC1GLS__G1D3N" />
            <bitfield caption="Gate 1 Data Source 3 True Enable bit" mask="0x00000020" name="G1D3T" values="CLC1GLS__G1D3T" />
            <bitfield caption="Gate 1 Data Source 4 Negated Enable bit" mask="0x00000040" name="G1D4N" values="CLC1GLS__G1D4N" />
            <bitfield caption="Gate 1 Data Source 4 True Enable bit" mask="0x00000080" name="G1D4T" values="CLC1GLS__G1D4T" />
            <bitfield caption="Gate 2 Data Source 1 Negated Enable bit" mask="0x00000100" name="G2D1N" values="CLC1GLS__G2D1N" />
            <bitfield caption="Gate 2 Data Source 1 True Enable bit" mask="0x00000200" name="G2D1T" values="CLC1GLS__G2D1T" />
            <bitfield caption="Gate 2 Data Source 2 Negated Enable bit" mask="0x00000400" name="G2D2N" values="CLC1GLS__G2D2N" />
            <bitfield caption="Gate 2 Data Source 2 True Enable bit" mask="0x00000800" name="G2D2T" values="CLC1GLS__G2D2T" />
            <bitfield caption="Gate 2 Data Source 3 Negated Enable bit" mask="0x00001000" name="G2D3N" values="CLC1GLS__G2D3N" />
            <bitfield caption="Gate 2 Data Source 3 True Enable bit" mask="0x00002000" name="G2D3T" values="CLC1GLS__G2D3T" />
            <bitfield caption="Gate 2 Data Source 4 Negated Enable bit" mask="0x00004000" name="G2D4N" values="CLC1GLS__G2D4N" />
            <bitfield caption="Gate 2 Data Source 4 True Enable bit" mask="0x00008000" name="G2D4T" values="CLC1GLS__G2D4T" />
            <bitfield caption="Gate 3 Data Source 1 Negated Enable bit" mask="0x00010000" name="G3D1N" values="CLC1GLS__G3D1N" />
            <bitfield caption="Gate 3 Data Source 1 True Enable bit" mask="0x00020000" name="G3D1T" values="CLC1GLS__G3D1T" />
            <bitfield caption="Gate 3 Data Source 2 Negated Enable bit" mask="0x00040000" name="G3D2N" values="CLC1GLS__G3D2N" />
            <bitfield caption="Gate 3 Data Source 2 True Enable bit" mask="0x00080000" name="G3D2T" values="CLC1GLS__G3D2T" />
            <bitfield caption="Gate 3 Data Source 3 Negated Enable bit" mask="0x00100000" name="G3D3N" values="CLC1GLS__G3D3N" />
            <bitfield caption="Gate 3 Data Source 3 True Enable bit" mask="0x00200000" name="G3D3T" values="CLC1GLS__G3D3T" />
            <bitfield caption="Gate 3 Data Source 4 Negated Enable bit" mask="0x00400000" name="G3D4N" values="CLC1GLS__G3D4N" />
            <bitfield caption="Gate 3 Data Source 4 True Enable bit" mask="0x00800000" name="G3D4T" values="CLC1GLS__G3D4T" />
            <bitfield caption="Gate 4 Data Source 1 Negated Enable bit" mask="0x01000000" name="G4D1N" values="CLC1GLS__G4D1N" />
            <bitfield caption="Gate 4 Data Source 1 True Enable bit" mask="0x02000000" name="G4D1T" values="CLC1GLS__G4D1T" />
            <bitfield caption="Gate 4 Data Source 2 Negated Enable bit" mask="0x04000000" name="G4D2N" values="CLC1GLS__G4D2N" />
            <bitfield caption="Gate 4 Data Source 2 True Enable bit" mask="0x08000000" name="G4D2T" values="CLC1GLS__G4D2T" />
            <bitfield caption="Gate 4 Data Source 3 Negated Enable bit" mask="0x10000000" name="G4D3N" values="CLC1GLS__G4D3N" />
            <bitfield caption="Gate 4 Data Source 3 True Enable bit" mask="0x20000000" name="G4D3T" values="CLC1GLS__G4D3T" />
            <bitfield caption="Gate 4 Data Source 4 Negated Enable bit" mask="0x40000000" name="G4D4N" values="CLC1GLS__G4D4N" />
            <bitfield caption="Gate 4 Data Source 4 True Enable bit" mask="0x80000000" name="G4D4T" values="CLC1GLS__G4D4T" />
         </register>
         <register caption="" name="CLC2GLS" offset="0x220" rw="RW" size="4">
            <bitfield caption="Gate 1 Data Source 1 Negated Enable bit" mask="0x00000001" name="G1D1N" values="CLC2GLS__G1D1N" />
            <bitfield caption="Gate 1 Data Source 1 True Enable bit" mask="0x00000002" name="G1D1T" values="CLC2GLS__G1D1T" />
            <bitfield caption="Gate 1 Data Source 2 Negated Enable bit" mask="0x00000004" name="G1D2N" values="CLC2GLS__G1D2N" />
            <bitfield caption="Gate 1 Data Source 2 True Enable bit" mask="0x00000008" name="G1D2T" values="CLC2GLS__G1D2T" />
            <bitfield caption="Gate 1 Data Source 3 Negated Enable bit" mask="0x00000010" name="G1D3N" values="CLC2GLS__G1D3N" />
            <bitfield caption="Gate 1 Data Source 3 True Enable bit" mask="0x00000020" name="G1D3T" values="CLC2GLS__G1D3T" />
            <bitfield caption="Gate 1 Data Source 4 Negated Enable bit" mask="0x00000040" name="G1D4N" values="CLC2GLS__G1D4N" />
            <bitfield caption="Gate 1 Data Source 4 True Enable bit" mask="0x00000080" name="G1D4T" values="CLC2GLS__G1D4T" />
            <bitfield caption="Gate 2 Data Source 1 Negated Enable bit" mask="0x00000100" name="G2D1N" values="CLC2GLS__G2D1N" />
            <bitfield caption="Gate 2 Data Source 1 True Enable bit" mask="0x00000200" name="G2D1T" values="CLC2GLS__G2D1T" />
            <bitfield caption="Gate 2 Data Source 2 Negated Enable bit" mask="0x00000400" name="G2D2N" values="CLC2GLS__G2D2N" />
            <bitfield caption="Gate 2 Data Source 2 True Enable bit" mask="0x00000800" name="G2D2T" values="CLC2GLS__G2D2T" />
            <bitfield caption="Gate 2 Data Source 3 Negated Enable bit" mask="0x00001000" name="G2D3N" values="CLC2GLS__G2D3N" />
            <bitfield caption="Gate 2 Data Source 3 True Enable bit" mask="0x00002000" name="G2D3T" values="CLC2GLS__G2D3T" />
            <bitfield caption="Gate 2 Data Source 4 Negated Enable bit" mask="0x00004000" name="G2D4N" values="CLC2GLS__G2D4N" />
            <bitfield caption="Gate 2 Data Source 4 True Enable bit" mask="0x00008000" name="G2D4T" values="CLC2GLS__G2D4T" />
            <bitfield caption="Gate 3 Data Source 1 Negated Enable bit" mask="0x00010000" name="G3D1N" values="CLC2GLS__G3D1N" />
            <bitfield caption="Gate 3 Data Source 1 True Enable bit" mask="0x00020000" name="G3D1T" values="CLC2GLS__G3D1T" />
            <bitfield caption="Gate 3 Data Source 2 Negated Enable bit" mask="0x00040000" name="G3D2N" values="CLC2GLS__G3D2N" />
            <bitfield caption="Gate 3 Data Source 2 True Enable bit" mask="0x00080000" name="G3D2T" values="CLC2GLS__G3D2T" />
            <bitfield caption="Gate 3 Data Source 3 Negated Enable bit" mask="0x00100000" name="G3D3N" values="CLC2GLS__G3D3N" />
            <bitfield caption="Gate 3 Data Source 3 True Enable bit" mask="0x00200000" name="G3D3T" values="CLC2GLS__G3D3T" />
            <bitfield caption="Gate 3 Data Source 4 Negated Enable bit" mask="0x00400000" name="G3D4N" values="CLC2GLS__G3D4N" />
            <bitfield caption="Gate 3 Data Source 4 True Enable bit" mask="0x00800000" name="G3D4T" values="CLC2GLS__G3D4T" />
            <bitfield caption="Gate 4 Data Source 1 Negated Enable bit" mask="0x01000000" name="G4D1N" values="CLC2GLS__G4D1N" />
            <bitfield caption="Gate 4 Data Source 1 True Enable bit" mask="0x02000000" name="G4D1T" values="CLC2GLS__G4D1T" />
            <bitfield caption="Gate 4 Data Source 2 Negated Enable bit" mask="0x04000000" name="G4D2N" values="CLC2GLS__G4D2N" />
            <bitfield caption="Gate 4 Data Source 2 True Enable bit" mask="0x08000000" name="G4D2T" values="CLC2GLS__G4D2T" />
            <bitfield caption="Gate 4 Data Source 3 Negated Enable bit" mask="0x10000000" name="G4D3N" values="CLC2GLS__G4D3N" />
            <bitfield caption="Gate 4 Data Source 3 True Enable bit" mask="0x20000000" name="G4D3T" values="CLC2GLS__G4D3T" />
            <bitfield caption="Gate 4 Data Source 4 Negated Enable bit" mask="0x40000000" name="G4D4N" values="CLC2GLS__G4D4N" />
            <bitfield caption="Gate 4 Data Source 4 True Enable bit" mask="0x80000000" name="G4D4T" values="CLC2GLS__G4D4T" />
         </register>
         <register caption="" name="CLC3GLS" offset="0x420" rw="RW" size="4">
            <bitfield caption="Gate 1 Data Source 1 Negated Enable bit" mask="0x00000001" name="G1D1N" values="CLC3GLS__G1D1N" />
            <bitfield caption="Gate 1 Data Source 1 True Enable bit" mask="0x00000002" name="G1D1T" values="CLC3GLS__G1D1T" />
            <bitfield caption="Gate 1 Data Source 2 Negated Enable bit" mask="0x00000004" name="G1D2N" values="CLC3GLS__G1D2N" />
            <bitfield caption="Gate 1 Data Source 2 True Enable bit" mask="0x00000008" name="G1D2T" values="CLC3GLS__G1D2T" />
            <bitfield caption="Gate 1 Data Source 3 Negated Enable bit" mask="0x00000010" name="G1D3N" values="CLC3GLS__G1D3N" />
            <bitfield caption="Gate 1 Data Source 3 True Enable bit" mask="0x00000020" name="G1D3T" values="CLC3GLS__G1D3T" />
            <bitfield caption="Gate 1 Data Source 4 Negated Enable bit" mask="0x00000040" name="G1D4N" values="CLC3GLS__G1D4N" />
            <bitfield caption="Gate 1 Data Source 4 True Enable bit" mask="0x00000080" name="G1D4T" values="CLC3GLS__G1D4T" />
            <bitfield caption="Gate 2 Data Source 1 Negated Enable bit" mask="0x00000100" name="G2D1N" values="CLC3GLS__G2D1N" />
            <bitfield caption="Gate 2 Data Source 1 True Enable bit" mask="0x00000200" name="G2D1T" values="CLC3GLS__G2D1T" />
            <bitfield caption="Gate 2 Data Source 2 Negated Enable bit" mask="0x00000400" name="G2D2N" values="CLC3GLS__G2D2N" />
            <bitfield caption="Gate 2 Data Source 2 True Enable bit" mask="0x00000800" name="G2D2T" values="CLC3GLS__G2D2T" />
            <bitfield caption="Gate 2 Data Source 3 Negated Enable bit" mask="0x00001000" name="G2D3N" values="CLC3GLS__G2D3N" />
            <bitfield caption="Gate 2 Data Source 3 True Enable bit" mask="0x00002000" name="G2D3T" values="CLC3GLS__G2D3T" />
            <bitfield caption="Gate 2 Data Source 4 Negated Enable bit" mask="0x00004000" name="G2D4N" values="CLC3GLS__G2D4N" />
            <bitfield caption="Gate 2 Data Source 4 True Enable bit" mask="0x00008000" name="G2D4T" values="CLC3GLS__G2D4T" />
            <bitfield caption="Gate 3 Data Source 1 Negated Enable bit" mask="0x00010000" name="G3D1N" values="CLC3GLS__G3D1N" />
            <bitfield caption="Gate 3 Data Source 1 True Enable bit" mask="0x00020000" name="G3D1T" values="CLC3GLS__G3D1T" />
            <bitfield caption="Gate 3 Data Source 2 Negated Enable bit" mask="0x00040000" name="G3D2N" values="CLC3GLS__G3D2N" />
            <bitfield caption="Gate 3 Data Source 2 True Enable bit" mask="0x00080000" name="G3D2T" values="CLC3GLS__G3D2T" />
            <bitfield caption="Gate 3 Data Source 3 Negated Enable bit" mask="0x00100000" name="G3D3N" values="CLC3GLS__G3D3N" />
            <bitfield caption="Gate 3 Data Source 3 True Enable bit" mask="0x00200000" name="G3D3T" values="CLC3GLS__G3D3T" />
            <bitfield caption="Gate 3 Data Source 4 Negated Enable bit" mask="0x00400000" name="G3D4N" values="CLC3GLS__G3D4N" />
            <bitfield caption="Gate 3 Data Source 4 True Enable bit" mask="0x00800000" name="G3D4T" values="CLC3GLS__G3D4T" />
            <bitfield caption="Gate 4 Data Source 1 Negated Enable bit" mask="0x01000000" name="G4D1N" values="CLC3GLS__G4D1N" />
            <bitfield caption="Gate 4 Data Source 1 True Enable bit" mask="0x02000000" name="G4D1T" values="CLC3GLS__G4D1T" />
            <bitfield caption="Gate 4 Data Source 2 Negated Enable bit" mask="0x04000000" name="G4D2N" values="CLC3GLS__G4D2N" />
            <bitfield caption="Gate 4 Data Source 2 True Enable bit" mask="0x08000000" name="G4D2T" values="CLC3GLS__G4D2T" />
            <bitfield caption="Gate 4 Data Source 3 Negated Enable bit" mask="0x10000000" name="G4D3N" values="CLC3GLS__G4D3N" />
            <bitfield caption="Gate 4 Data Source 3 True Enable bit" mask="0x20000000" name="G4D3T" values="CLC3GLS__G4D3T" />
            <bitfield caption="Gate 4 Data Source 4 Negated Enable bit" mask="0x40000000" name="G4D4N" values="CLC3GLS__G4D4N" />
            <bitfield caption="Gate 4 Data Source 4 True Enable bit" mask="0x80000000" name="G4D4T" values="CLC3GLS__G4D4T" />
         </register>
         <register caption="" name="CLC4GLS" offset="0x620" rw="RW" size="4">
            <bitfield caption="Gate 1 Data Source 1 Negated Enable bit" mask="0x00000001" name="G1D1N" values="CLC4GLS__G1D1N" />
            <bitfield caption="Gate 1 Data Source 1 True Enable bit" mask="0x00000002" name="G1D1T" values="CLC4GLS__G1D1T" />
            <bitfield caption="Gate 1 Data Source 2 Negated Enable bit" mask="0x00000004" name="G1D2N" values="CLC4GLS__G1D2N" />
            <bitfield caption="Gate 1 Data Source 2 True Enable bit" mask="0x00000008" name="G1D2T" values="CLC4GLS__G1D2T" />
            <bitfield caption="Gate 1 Data Source 3 Negated Enable bit" mask="0x00000010" name="G1D3N" values="CLC4GLS__G1D3N" />
            <bitfield caption="Gate 1 Data Source 3 True Enable bit" mask="0x00000020" name="G1D3T" values="CLC4GLS__G1D3T" />
            <bitfield caption="Gate 1 Data Source 4 Negated Enable bit" mask="0x00000040" name="G1D4N" values="CLC4GLS__G1D4N" />
            <bitfield caption="Gate 1 Data Source 4 True Enable bit" mask="0x00000080" name="G1D4T" values="CLC4GLS__G1D4T" />
            <bitfield caption="Gate 2 Data Source 1 Negated Enable bit" mask="0x00000100" name="G2D1N" values="CLC4GLS__G2D1N" />
            <bitfield caption="Gate 2 Data Source 1 True Enable bit" mask="0x00000200" name="G2D1T" values="CLC4GLS__G2D1T" />
            <bitfield caption="Gate 2 Data Source 2 Negated Enable bit" mask="0x00000400" name="G2D2N" values="CLC4GLS__G2D2N" />
            <bitfield caption="Gate 2 Data Source 2 True Enable bit" mask="0x00000800" name="G2D2T" values="CLC4GLS__G2D2T" />
            <bitfield caption="Gate 2 Data Source 3 Negated Enable bit" mask="0x00001000" name="G2D3N" values="CLC4GLS__G2D3N" />
            <bitfield caption="Gate 2 Data Source 3 True Enable bit" mask="0x00002000" name="G2D3T" values="CLC4GLS__G2D3T" />
            <bitfield caption="Gate 2 Data Source 4 Negated Enable bit" mask="0x00004000" name="G2D4N" values="CLC4GLS__G2D4N" />
            <bitfield caption="Gate 2 Data Source 4 True Enable bit" mask="0x00008000" name="G2D4T" values="CLC4GLS__G2D4T" />
            <bitfield caption="Gate 3 Data Source 1 Negated Enable bit" mask="0x00010000" name="G3D1N" values="CLC4GLS__G3D1N" />
            <bitfield caption="Gate 3 Data Source 1 True Enable bit" mask="0x00020000" name="G3D1T" values="CLC4GLS__G3D1T" />
            <bitfield caption="Gate 3 Data Source 2 Negated Enable bit" mask="0x00040000" name="G3D2N" values="CLC4GLS__G3D2N" />
            <bitfield caption="Gate 3 Data Source 2 True Enable bit" mask="0x00080000" name="G3D2T" values="CLC4GLS__G3D2T" />
            <bitfield caption="Gate 3 Data Source 3 Negated Enable bit" mask="0x00100000" name="G3D3N" values="CLC4GLS__G3D3N" />
            <bitfield caption="Gate 3 Data Source 3 True Enable bit" mask="0x00200000" name="G3D3T" values="CLC4GLS__G3D3T" />
            <bitfield caption="Gate 3 Data Source 4 Negated Enable bit" mask="0x00400000" name="G3D4N" values="CLC4GLS__G3D4N" />
            <bitfield caption="Gate 3 Data Source 4 True Enable bit" mask="0x00800000" name="G3D4T" values="CLC4GLS__G3D4T" />
            <bitfield caption="Gate 4 Data Source 1 Negated Enable bit" mask="0x01000000" name="G4D1N" values="CLC4GLS__G4D1N" />
            <bitfield caption="Gate 4 Data Source 1 True Enable bit" mask="0x02000000" name="G4D1T" values="CLC4GLS__G4D1T" />
            <bitfield caption="Gate 4 Data Source 2 Negated Enable bit" mask="0x04000000" name="G4D2N" values="CLC4GLS__G4D2N" />
            <bitfield caption="Gate 4 Data Source 2 True Enable bit" mask="0x08000000" name="G4D2T" values="CLC4GLS__G4D2T" />
            <bitfield caption="Gate 4 Data Source 3 Negated Enable bit" mask="0x10000000" name="G4D3N" values="CLC4GLS__G4D3N" />
            <bitfield caption="Gate 4 Data Source 3 True Enable bit" mask="0x20000000" name="G4D3T" values="CLC4GLS__G4D3T" />
            <bitfield caption="Gate 4 Data Source 4 Negated Enable bit" mask="0x40000000" name="G4D4N" values="CLC4GLS__G4D4N" />
            <bitfield caption="Gate 4 Data Source 4 True Enable bit" mask="0x80000000" name="G4D4T" values="CLC4GLS__G4D4T" />
         </register>
      </register-group>
      <value-group caption="CLCx Mode bits" name="CLC1CON__MODE">
         <value caption="Cell is a 1-input transparent latch with S and R" name="" value="0x7" />
         <value caption="Cell is a JK flip-flop with R" name="" value="0x6" />
         <value caption="Cell is a 2-input D flip-flop with R" name="" value="0x5" />
         <value caption="Cell is a 1-input D flip-flop with S and R" name="" value="0x4" />
         <value caption="Cell is an SR latch" name="" value="0x3" />
         <value caption="Cell is a 4-input AND" name="" value="0x2" />
         <value caption="Cell is an OR-XOR" name="" value="0x1" />
         <value caption="Cell is a AND-OR" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Output Polarity Control bit" name="CLC1CON__LCPOL">
         <value caption="The output of the module is inverted" name="" value="0x1" />
         <value caption="The output of the module is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Data Output Status bit" name="CLC1CON__LCOUT">
         <value caption="CLCx output high" name="" value="0x1" />
         <value caption="CLCx output low" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Port Enable bit" name="CLC1CON__LCOE">
         <value caption="CLCx port pin output is enabled" name="" value="0x1" />
         <value caption="CLCx port pin output is disabled" name="" value="0x0" />
      </value-group>
