Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/atdf/PIC32MK0512GPG064.atdf
      <value-group caption="Gate 4 Polarity Control bit" name="CLC4CON__G4POL">
         <value caption="The output of Channel 4 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 4 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 1 Signal Selection bits" name="CLC1SEL__DS1">
         <value caption="TMR2 compare match event" name="" value="0x7" />
         <value caption="OCMP1 event" name="" value="0x6" />
         <value caption="ICAP1 event" name="" value="0x5" />
         <value caption="REFO2 Clock Output" name="" value="0x4" />
         <value caption="LPRC Clock" name="" value="0x3" />
         <value caption="SOSC Clock" name="" value="0x2" />
         <value caption="System Clock" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 2 Signal Selection bits" name="CLC1SEL__DS2">
         <value caption="TMR3 compare match event" name="" value="0x7" />
         <value caption="OCMP2 event" name="" value="0x6" />
         <value caption="ICAP2 event" name="" value="0x5" />
         <value caption="ADC7 End of Conversion" name="" value="0x4" />
         <value caption="UART1 TX Out" name="" value="0x3" />
         <value caption="CMP1 out" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC1SEL__DS3">
         <value caption="TMR4 Compare match event" name="" value="0x7" />
         <value caption="OCMP3 event" name="" value="0x6" />
         <value caption="ICAP3 event" name="" value="0x5" />
         <value caption="UART1 RX In" name="" value="0x4" />
         <value caption="SPI SDO Out" name="" value="0x3" />
         <value caption="CMP2 out" name="" value="0x2" />
         <value caption="CLC1 Out" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC1SEL__DS4">
         <value caption="UART1 BCLK/RTS" name="" value="0x7" />
         <value caption="OCMP4 event" name="" value="0x6" />
         <value caption="ICAP4 event " name="" value="0x5" />
         <value caption="RTCC event" name="" value="0x4" />
         <value caption="SPI1 SDI1 in" name="" value="0x3" />
         <value caption="TMR2 Sync Out" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 1 Signal Selection bits" name="CLC2SEL__DS1">
         <value caption="TMR2 Compare event" name="" value="0x7" />
         <value caption="OCMP1 event" name="" value="0x6" />
         <value caption="ICAP1 event" name="" value="0x5" />
         <value caption="REFO2 Clock Output" name="" value="0x4" />
         <value caption="LPRC Clock" name="" value="0x3" />
         <value caption="SOSC Clock" name="" value="0x2" />
         <value caption="System Clock" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 2 Signal Selection bits" name="CLC2SEL__DS2">
         <value caption="TMR3 Compare event" name="" value="0x7" />
         <value caption="OCMP2 event" name="" value="0x6" />
         <value caption="ICAP2 event" name="" value="0x5" />
         <value caption="ADC0 End of Conversion" name="" value="0x4" />
         <value caption="UART2 TX out" name="" value="0x3" />
         <value caption="CMP2 out" name="" value="0x2" />
         <value caption="PWM1H Out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC2SEL__DS3">
         <value caption="TMR4 Compare Event" name="" value="0x7" />
         <value caption="OCMP3 Output" name="" value="0x6" />
         <value caption="ICAP3 Event" name="" value="0x5" />
         <value caption="PWM2H Out" name="" value="0x4" />
         <value caption="SPI2 SDO Out" name="" value="0x3" />
         <value caption="CMP3 out" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC2SEL__DS4">
         <value caption="TMR5 Compare Event" name="" value="0x7" />
         <value caption="OCMP4 Output" name="" value="0x6" />
         <value caption="ICAP4 Event" name="" value="0x5" />
         <value caption="PWM3H Out" name="" value="0x4" />
         <value caption="SPI2 SDI2 in" name="" value="0x3" />
         <value caption="TMR3 Sync" name="" value="0x2" />
         <value caption="CLC3 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 1 Signal Selection bits" name="CLC3SEL__DS1">
         <value caption="TMR6 Compare Event" name="" value="0x7" />
         <value caption="OCMP5 Output" name="" value="0x6" />
         <value caption="ICAP5 Event" name="" value="0x5" />
         <value caption="REFO2 Clock Output" name="" value="0x4" />
         <value caption="LPRC Clock" name="" value="0x3" />
         <value caption="SOSC Clock" name="" value="0x2" />
         <value caption="System Clock" name="" value="0x1" />
         <value caption="CLCINC I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 2 Signal Selection bits" name="CLC3SEL__DS2">
         <value caption="TMR7 Compare Event" name="" value="0x7" />
         <value caption="OCMP6 Output" name="" value="0x6" />
         <value caption="ICAP6 Event" name="" value="0x5" />
         <value caption="ADC1 End of Conversion" name="" value="0x4" />
         <value caption="PWM4H Out" name="" value="0x3" />
         <value caption="CMP3 out" name="" value="0x2" />
         <value caption="CLC4 out" name="" value="0x1" />
         <value caption="CLCIND I/O pin" name="" value="0x0" />
      </value-group>
