Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/atdf/PIC32MK0512GPG064.atdf
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC3SEL__DS3">
         <value caption="TMR8 Compare Event" name="" value="0x7" />
         <value caption="OCMP7 event" name="" value="0x6" />
         <value caption="ICAP7 event" name="" value="0x5" />
         <value caption="UART2 RX In" name="" value="0x4" />
         <value caption="PWM5H out" name="" value="0x3" />
         <value caption="CMP4 out" name="" value="0x2" />
         <value caption="CLC3 out" name="" value="0x1" />
         <value caption="CLCINC I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC3SEL__DS4">
         <value caption="ADC2 End of Conversion" name="" value="0x7" />
         <value caption="OCMP8 Output" name="" value="0x6" />
         <value caption="ICAP8 event" name="" value="0x5" />
         <value caption="RTCC event" name="" value="0x4" />
         <value caption="PWM6H Out" name="" value="0x3" />
         <value caption="TMR6 Sync" name="" value="0x2" />
         <value caption="CLC4 out" name="" value="0x1" />
         <value caption="CLCIND I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 1 Signal Selection bits" name="CLC4SEL__DS1">
         <value caption="TMR6 compare event" name="" value="0x7" />
         <value caption="OCMP5 Output" name="" value="0x6" />
         <value caption="ICAP5 event" name="" value="0x5" />
         <value caption="REFO2 Clock Output" name="" value="0x4" />
         <value caption="LPRC Clock" name="" value="0x3" />
         <value caption="SOSC Clock" name="" value="0x2" />
         <value caption="System Clock" name="" value="0x1" />
         <value caption="CLCINC I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 2 Signal Selection bits" name="CLC4SEL__DS2">
         <value caption="TMR7 compare event" name="" value="0x7" />
         <value caption="OCMP6 Output" name="" value="0x6" />
         <value caption="ICAP6 event" name="" value="0x5" />
         <value caption="ADC3 End of Conversion" name="" value="0x4" />
         <value caption="PWM7H Out" name="" value="0x3" />
         <value caption="CMP4 out" name="" value="0x2" />
         <value caption="DMA Channel 0 Interrupt" name="" value="0x1" />
         <value caption="CLCIND I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC4SEL__DS3">
         <value caption="TMR8 compare event" name="" value="0x7" />
         <value caption="OCMP7 event" name="" value="0x6" />
         <value caption="ICAP7 event" name="" value="0x5" />
         <value caption="ADC4 end of conversion" name="" value="0x4" />
         <value caption="PWM8H Out" name="" value="0x3" />
         <value caption="CMP5 out" name="" value="0x2" />
         <value caption="CLC3 out" name="" value="0x1" />
         <value caption="CLCINC I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC4SEL__DS4">
         <value caption="TMR9 compare event" name="" value="0x7" />
         <value caption="OCMP8 event" name="" value="0x6" />
         <value caption="ICAP8 event" name="" value="0x5" />
         <value caption="RTCC event" name="" value="0x4" />
         <value caption="PWM9H Out" name="" value="0x3" />
         <value caption="ADC5 End of Conversion" name="" value="0x2" />
         <value caption="CLC4 out" name="" value="0x1" />
         <value caption="CLCIND I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 1 Negated Enable bit" name="CLC1GLS__G1D1N">
         <value caption="The Data Source 1 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 1 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 1 True Enable bit" name="CLC1GLS__G1D1T">
         <value caption="The Data Source 1 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 1 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 2 Negated Enable bit" name="CLC1GLS__G1D2N">
         <value caption="The Data Source 2 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 2 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 2 True Enable bit" name="CLC1GLS__G1D2T">
         <value caption="The Data Source 2 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 2 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 3 Negated Enable bit" name="CLC1GLS__G1D3N">
         <value caption="The Data Source 3 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 3 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 3 True Enable bit" name="CLC1GLS__G1D3T">
         <value caption="The Data Source 3 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 3 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 4 Negated Enable bit" name="CLC1GLS__G1D4N">
         <value caption="The Data Source 4 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 4 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 4 True Enable bit" name="CLC1GLS__G1D4T">
         <value caption="The Data Source 4 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 4 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
