Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/atdf/PIC32MK0512GPG064.atdf
      <value-group caption="Real-Time Clock Value Registers Write Enable bit" name="RTCCON__RTCWREN">
         <value caption="Real-Time Clock Value registers can be written to by the user" name="" value="0x1" />
         <value caption="Real-Time Clock Value registers are locked out from being written to by the user" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Clock Enable Status bit" name="RTCCON__RTCCLKON">
         <value caption="RTCC Clock is actively running" name="" value="0x1" />
         <value caption="RTCC Clock is not running" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Output Data Select bits" name="RTCCON__RTCOUTSEL">
         <value caption="RTCC Clock is presented on the RTCC pin" name="" value="0x2" />
         <value caption="Seconds Clock is presented on the RTCC pin" name="" value="0x1" />
         <value caption="Alarm Pulse is presented on the RTCC pin when the alarm interrupt is triggered" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Clock Select bits" name="RTCCON__RTCCLKSEL">
         <value caption="RTCC uses the external 32.768 kHz Secondary Oscillator (SOSC)" name="" value="0x1" />
         <value caption="RTCC uses the internal 32 kHz oscillator (LPRC)" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="RTCCON__SIDL">
         <value caption="Disables RTCC operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue normal operation when CPU enters Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC On bit" name="RTCCON__ON">
         <value caption="RTCC module is enabled" name="" value="0x1" />
         <value caption="RTCC module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Real-Time Clock Drift Calibration bits" name="RTCCON__CAL">
         <value caption="Maximum positive adjustment" name="" value="0x1ff" />
         <value caption="Minimum positive adjustment" name="" value="0x1" />
         <value caption="No adjustment" name="" value="0x0" />
         <value caption="Minimum negative adjustment" name="" value="0x3ff" />
         <value caption="Minimum negative adjustment" name="" value="0x200" />
      </value-group>
      <value-group caption="Alarm Repeat Counter Value bits" name="RTCALRM__ARPT">
         <value caption="Alarm will trigger 256 times" name="" value="0xff" />
         <value caption="Alarm will trigger 255 times" name="" value="0xfe" />
         <value caption="Alarm will trigger two times" name="" value="0x1" />
         <value caption="Alarm will trigger one time" name="" value="0x0" />
      </value-group>
      <value-group caption="Alarm Mask Configuration bits" name="RTCALRM__AMASK">
         <value caption="Every half-second" name="" value="0x0" />
         <value caption="Every second" name="" value="0x1" />
         <value caption="Every 10 seconds" name="" value="0x2" />
         <value caption="Every minute" name="" value="0x3" />
         <value caption="Every 10 minutes" name="" value="0x4" />
         <value caption="Every hour" name="" value="0x5" />
         <value caption="Once a day" name="" value="0x6" />
         <value caption="Once a week" name="" value="0x7" />
         <value caption="Once a month" name="" value="0x8" />
         <value caption="Once a year (except when configured for February 29" name="" value="0x9" />
      </value-group>
      <value-group caption="Alarm Sync bit" name="RTCALRM__ALRMSYNC">
         <value caption="ARPT and ALRMEN may change as a result of a half second rollover during a read. The ARPT must be read repeatedly until the same value is read twice. This must be done since multiple bits may be changing." name="" value="0x1" />
         <value caption="ARPT and ALRMEN can be read without concerns of rollover because the prescaler is more than 32 real-time clocks away from a half-second rollover" name="" value="0x0" />
      </value-group>
      <value-group caption="Alarm Pulse Initial Value bit" name="RTCALRM__PIV">
         <value caption="low initial value of the Alarm Pulse (When ALRMEN = 0)" name="" value="0x0" />
         <value caption="high initial value of the Alarm Pulse (When ALRMEN = 0)" name="" value="0x1" />
      </value-group>
      <value-group caption="Chime Enable bit" name="RTCALRM__CHIME">
         <value caption="Chime is enabled ARPT is allowed to rollover from 0x00 to 0xFF" name="" value="0x1" />
         <value caption="Chime is disabled ARPT stops once it reaches 0x00" name="" value="0x0" />
      </value-group>
      <value-group caption="Alarm Enable bit" name="RTCALRM__ALRMEN">
         <value caption="Alarm is enabled" name="" value="0x1" />
         <value caption="Alarm is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00136" name="SB" version="1">
      <register-group name="SB">
         <register caption="System Bus Status Flag Register" name="SBFLAG" offset="0x0" rw="R" size="4">
            <bitfield caption="Target 0 Permission Group Violation Status bits" mask="0x00000001" name="T0PGV" values="SBFLAG__T0PGV" />
            <bitfield caption="Target 1Permission Group Violation Status bits" mask="0x00000002" name="T1PGV" values="SBFLAG__T1PGV" />
            <bitfield caption="Target 2 Permission Group Violation Status bits" mask="0x00000004" name="T2PGV" values="SBFLAG__T2PGV" />
            <bitfield caption="Target 3 Permission Group Violation Status bits" mask="0x00000008" name="T3PGV" values="SBFLAG__T3PGV" />
            <bitfield caption="Target 4 Permission Group Violation Status bits" mask="0x00000010" name="T4PGV" values="SBFLAG__T4PGV" />
            <bitfield caption="Target 5 Permission Group Violation Status bits" mask="0x00000020" name="T5PGV" values="SBFLAG__T5PGV" />
            <bitfield caption="Target 6 Permission Group Violation Status bits" mask="0x00000040" name="T6PGV" values="SBFLAG__T6PGV" />
            <bitfield caption="Target 7 Permission Group Violation Status bits" mask="0x00000080" name="T7PGV" values="SBFLAG__T7PGV" />
            <bitfield caption="Target 8 Permission Group Violation Status bits" mask="0x00000100" name="T8PGV" values="SBFLAG__T8PGV" />
            <bitfield caption="Target 9 Permission Group Violation Status bits" mask="0x00000200" name="T9PGV" values="SBFLAG__T9PGV" />
            <bitfield caption="Target 10 Permission Group Violation Status bits" mask="0x00000400" name="T10PGV" values="SBFLAG__T10PGV" />
            <bitfield caption="Target 11 Permission Group Violation Status bits" mask="0x00000800" name="T11PGV" values="SBFLAG__T11PGV" />
            <bitfield caption="Target 12 Permission Group Violation Status bits" mask="0x00001000" name="T12PGV" values="SBFLAG__T12PGV" />
            <bitfield caption="Target 13 Permission Group Violation Status bits" mask="0x00002000" name="T13PGV" values="SBFLAG__T13PGV" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT0ELOG1" offset="0x7b10" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT0ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT0ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT0ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT0ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT0ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT1ELOG1" offset="0x7f10" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT1ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT1ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT1ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT1ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT1ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT2ELOG1" offset="0x8310" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT2ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT2ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT2ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT2ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT2ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT3ELOG1" offset="0x8710" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT3ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT3ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT3ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT3ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT3ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT0ELOG2" offset="0x7b14" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT0ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT1ELOG2" offset="0x7f14" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT1ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT2ELOG2" offset="0x8314" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT2ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT3ELOG2" offset="0x8714" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT3ELOG2__GROUP" />
         </register>
